echo "************ Задание 1 *********************"
echo "Дано целое четырехзначное число. Найти сумму его цифр."
a=1234
let "b1 = $a / 1000"
let "b2 = $a % 1000 / 100"
let "b3 = $a % 100 / 10"
let "b4 = $a % 10"
let "a2 = $b1 + $b2 + $b3 + $b4"
echo "Сумма = $a2"

echo "************ Задание 2 *********************"
echo "Определить длину окружности, площадь круга и объем шара для заданного радиуса."
r=10
let "l = 2 * 3 * $r"
let "s = 3 * $r * $r"
let "v = 4 / 3 * 3 * $r * $r * $r"
echo "Длина окружности = $l , площадь круга = $s , объем шара = $v "

echo "************ Задание 3 *********************"
echo "Задана площадь квадрата. Определить радиус описанной окружности."
k=10
let "ro = $k / 2"
echo "Радиус описанной окружности в квадрате = $ro"